app/Controllers/ReporteController.php

SELECT *
FROM `cliente`
WHERE `cliente`.`deleted_at` IS NULL
---
    public function index()
    {
        $cliente= new ClienteModel();
        $data['cliente']= $cliente->findAll();